/**
 * Created by andrew on 22.09.15.
 */

$(document).ready(function () {

/*-------------------удаление документа----------------------------------------------*/
	$('.del_doc_button').click(function (event) {
		// получаем ID удаляемого документа
		var id = $(this).parent().attr('doc_id');
		//alert('del '+ id);
		if (confirm("Точно хотите безвозвратно удалить \n документ №" + $('#doc_hat_' + id + ' .doc_num').text().trim() + " от " + $('#doc_hat_' + id + ' .doc_date').text().trim() + "?")) {
			// alert('delte');
			$.ajax({
				url: 'http://' + document.location.host + rootFolder + "/document/delete",
				type: 'POST',
				dataType: "json",
				data: {del_expense: id},
				// функция обработки ответа сервера
				error: function (data) {
					alert('Во время удаления произошла ошибка. Проверьте данные!');
					//alert(data);
				},
				success: function (data) {
					console.log(data);
					//alert(data.status);
					//alert(typeof data);
					// удалить строку из таблицы на странице в случае удачного удаления
					if (data.status == 'ok') {
						//location.reload();
						$('#' + id + ', #ch_' + id).remove();
					}


				}
			});
		}
		event.stopPropagation();	// что бы не обрабатывался onclick нижележащего элемента
	});


	/*-----------------------------------------------------------------*/

	/*-----------------------------------------------------------------*/
	/*-----------------------------------------------------------------*/
	/*-----------------------------------------------------------------*/
	/*-----------------------------------------------------------------*/
	/*-----------------------------------------------------------------*/
	/*-----------------------------------------------------------------*/


})