$(document).ready( function(){


/*-------------------------------------------------------------------------------*/
	$('#close_month').click(function(){
		//alert('Закрываем '+$('#month_num').val()+' '+$('#year_num').val())
		if (confirm('Закрываем '+$('#month_num').val()+' '+$('#year_num').val()+'?')) {
			// alert('delte');
			$.ajax({
          		url: 'http://'+document.location.host+"/metan_0.1/store/restClose",
          		type:'POST',
          		dataType: "json",
          		data: {month: $('#month_num').val(), year: $('#year_num').val()},
          			// функция обработки ответа сервера
          		error: function(data) {
          			// alert('Во время обработки произошла ошибка. Дайте в бубен программеру!!!');
          			alert(JSON.stringify(data));
          		},
		        success: function(data){
		        	// alert(JSON.stringify(data));
		        	// alert(data.status);
		        	//alert(typeof data);
		        	// удалить строку из таблицы на странице в случае удачного удаления
		        	if (data.status == 'ok') {
		        		//location.reload();
		        		alert('Месяц закрыт.');
		        		location.reload();
		        	}


		        }
	        });
		}

	})

/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------*/




});