<?php

class invoiceAction extends CAction   /*---- StoreController ----*/
{
   public function run()
	{
		if(Yii::app()->request->isAjaxRequest)
		{

        	echo 'Неправильный запрос';
        	exit;
		}		// // if(Yii::app()->request->isAjaxRequest)

		/*--------------------------------------------------------------*/

		$this->controller->pageTitle = 'Счёт-фактура';
		$this->controller->render('invoice'/*, array('data'=>$res)*/);
	}
/*-----------------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------*/

}	// end receiptAction